---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinNumberOfBars
source: html/21f6b8ed-038e-eebd-1e46-eda3adb943e2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinNumberOfBars Property

"Number Of Bars"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinNumberOfBars { get; }
```